"SPC Password" = "Contraseña SPC";
"Authentication Key" = "Clave de autenticación";
"Incorrect key" = "Clave incorrecta";
"Incorrect SPC Password" = "Contraseña SPC incorrecta";
"Enter 26 digit key" = "Introduzca la clave de autenticación de 26 dígitos.";
"Security" = "Seguridad";
"Too many retries of SPC." = "Demasiados intentos de SPC.";
"AKEY set successfully." = "AKEY configurada correctamente.";
"Failed to set AKEY." = "Error al configurar AKEY.";
"Too many retries of AKEY." = "Demasiados intentos de AKEY.";
"Password" = "Contraseña";
"Key" = "Clave";
"OK" = "OK";
"Cancel" = "Cancelar";